{"data": {"certifications": [], "dateOfBirth": null, "education": [{"organization": "University at Buffalo, The State University of New York", "accreditation": {"education": "Master of Science", "inputStr": "Masters of Science Computer Science Engineering", "matchStr": "Master of Science", "educationLevel": "masters"}, "grade": null, "location": null, "dates": {"completionDate": "2020-02-01", "isCurrent": false}}, {"organization": "Vidyalankar Institute of Technology, Mumbai University", "accreditation": {"education": "Bachelor of Engineering", "inputStr": "Bachelor of Engineering Computer Engineering", "matchStr": "Bachelor of Engineering", "educationLevel": "bachelors"}, "grade": null, "location": null, "dates": {"completionDate": "2018-03-01", "isCurrent": false}}], "emails": ["parthnay@buffalo.edu"], "location": null, "name": {"raw": "PARTH", "first": "Parth", "last": "", "middle": "", "title": ""}, "objective": "", "phoneNumbers": ["716-292-9218"], "publications": [], "referees": [], "sections": [{"sectionType": "PersonalDetails", "bbox": [14.9001216888428, 19.8044335508234, 131.642349243164, 119.828695254918], "pageIndex": 0, "text": "PARTH\nSHAH\nparthnay@buffalo.edu\nparthshah1509.github.io\n716-292-9218\nparthshah1509\nparthshah1509\n\n\n\n\n"}, {"sectionType": "Education", "bbox": [165.576171875, 21.190767288208, 582.073913574219, 93.6623687744141], "pageIndex": 0, "text": "Education\nUniversity at Buffalo, The State University of New York  Masters of Science Computer Science Engineering 2020\nSept. 2018 to Feb. 2020\nVidyalankar Institute of Technology, Mumbai University  Bachelor of Engineering Computer Engineering 2018\nJune 2014 to Mar. 2018"}, {"sectionType": "WorkExperience", "bbox": [165.576171875, 115.974342346191, 582.073913574219, 274.596130371094], "pageIndex": 0, "text": "Relevant Experience\nIntern – Technical Team  Cloud Counselage Pvt. Ltd,\nMumbai, India  Mar. 2018 to July 2018\nHandled technicalities for various SaaS Cloud products such as Edpedia – The Learning Management System, Job Cloud – The  Online Job Board, Directory Cloud – The Online Business Directory Services & B2B Market Place.  Created the skeleton for the android application for the company and its version control. Maintaining company website and  increased server performance by 30% by migrating to GCP.\nIntern – Android App Development  FP Design - Part of Frischmann Prabhu India Pvt Ltd  Project: Augmented Reality Based Virtual Furniture\nMumbai, India  Sept. 2017 to Feb. 2018\nDesigned an Augmented Reality (AR) based application which can be used to visualize life-size furniture in your room using  your phone camera.  Coalesced a feature which allows customers to customize furniture according to color/texture of their choice using barcodes  from the catalogue.  Used Unity and Vuforia for the AR part and Blender to create the 3D models as requested by the company."}, {"sectionType": "Summary", "bbox": [14.9001216888428, 132.968597412109, 131.642349243164, 302.954742431641], "pageIndex": 0, "text": "Summary\nam a graduate student at University  at Bu•alo, looking at a Machine  Learning major along with  supplementary courses in Algorithms  and Data Science. My ongoing  projects include learning the e•ect of  attention models used for machine  translation on Genderbias. I am  currently taking Deep Learning and  Data Model and Query Language  courses. My previous courses were  Algorithm Analysis, Intro to Machine  Learning, Computer Security and  Information Retrieval, Advanced  Machine Learning, Distributed  Systems, Sequential and Parallel  Algorithms."}, {"sectionType": "Projects", "bbox": [165.576171875, 296.345123291016, 582.073913574219, 644.479309082031], "pageIndex": 0, "text": "Relevant Projects\nSequence to Sequence Machine Translation and Gender Bias Analysis\nFeb. 2019 to June 2019\nDesigned a multilayer bi-directional LSTM Recurrent Neural Network Model divided in three parts Encoder, Attention and\nDecoder and used it for translation from German to English using seq2seq and then analysed on the basis of gender bias.\nTrained and tested the model on the data from the Europarl v7, Common Crawl, and News Commentary v11 corpora from WMT\n'16. Produced a BLEU Score of 27.6 for 2 layers and 28.7 for 4 layer models comparable to the original paper.\nTook a sample of 100K sentences with BLEU score over 0.9 for Gender Bias analysis found that 30% of sentences have an error\nwith respect to gender.\nAmazon Dynamo-style key-value storage\nMar. 2019 to Mar. 2019\nDevised a simpli•ed version of Amazon Dynamo in an android group messenger application for up to 5 nodes with an easily  scalable architecture.  Reproduced three features of Dynamo viz:- 1) Partitioning, 2) Replication, and 3) Failure handling.  Assured both availability and linearizability at the same time with a 99% success rate over-vigorous testing under multiple  failures and requests at a time.\nForensic pattern recognition using Explainable AI\nFeb. 2019 to Feb. 2019\nAnnotated a dataset of handmade features for a total of 13570 'AND' images consisting of 15 features.  Generated multiple PGM's from intuitive feature selection and hill-climbing made into Bayesian Models and Markov Models  using pgmpy in python.  Created a Siamese Neural Network to learn a representation of features from the 'and' images used to predict pairs using  patterns learnt from them. Achieved an accuracy of 74%  Built an AutoEncoder to learn the same pattern as in the Siamese Network so as to compare the accuracies using the same  'AND' image pairs. Achieved an accuracy of 91%.  Built a Multitask Learning (MTL) model to learn the mapping between \"AND\" images and handcrafted features, using the  AutoEncoder latent features and 15 Neural Networks customized to each di•erent feature of the image.\nUnpaired Image-to-Image Translation with Conditional Adversarial Networks\nApr. 2019 to Apr. 2019\nImplemented CycleGAN Model to show emoji-style transfer between Apple<->Windows emoji style.  Assembled a 3 layer model with a Deep Convolution GAN, trained using the cyclic consistency loss with a CycleGAN  discriminator.  Trained and Tested with 2000 emojis of both styles using multiple settings obtaining signi•cantly improved results over other  standard Generative Models\n!404 - An Information Retrieval System\nOct. 2018 to Nov. 2018\nDeployed a Full-Fledged Information Retrieval System as a part of a •nal project for the subject Information Retrieval.  (https://youtu.be/u1SpF9V1lBY)  Worked in a group of 4. Responsible for the UI development, World map representation, word cloud generation and overall  supervision."}, {"sectionType": "Skills/Interests/Languages", "bbox": [14.9001216888428, 321.966827392578, 131.642349243164, 396.363525390625], "pageIndex": 0, "text": "Skills\nAlgorithms  Android Development  Vuforia Unity 3D  Wordpress  Machine Learning"}, {"sectionType": "Skills/Interests/Languages", "bbox": [14.9001216888428, 410.743041992188, 131.642349243164, 616.9140625], "pageIndex": 0, "text": "PROGRAMMING LANGUAGES\nJava Python  C/C++  HTML  JavaScript  CSS  XML XQuery  MySQL\nLIBRARIES  p5.js  Tensor•ow  Keras PyTorch  SOLR Processing  Firebase  SOLR"}, {"sectionType": "Achievements", "bbox": [165.576171875, 664.270935058594, 582.073913574219, 776.088000006974], "pageIndex": 0, "text": "/\nAwards and Certifications\nGoogle partnered with Udacity · Recipient of Google India Challenge Scholarship: Android Developer Feb. 2018  Google India's association with Udacity, for o•ering scholarships for aspiring Android developers. 1,000 Challenge Scholarships were  given out on selection basis pertaining to the student's performance in the coding round. The Challenge scholarship lasted 90 days.\nCoursera · Machine Learning by Andrew NG  Coursera Course on Machine Learning by Andrew NG\nNov. 2018"}], "skills": ["Management", "Microsoft Word", "Java (Programming Language)", "JavaScript (Programming Language)", "C (Programming Language)", "MySQL", "Python (Programming Language)", "WordPress", "Data Science", "Computer Security", "Algorithms", "Machine Learning", "Business Directory", "Mapping", "Information Retrieval", "Pattern Recognition", "Version Control", "Augmented Reality", "Machine Translation", "English Language", "Dynamo", "XQuery", "Feature Selection", "Keras (Neural Network Library)", "Extensible Markup Language (XML)", "German Language", "Dataset", "Blender (Device)", "Long Short-Term Memory (LSTM)", "Network Model", "PyTorch (Machine Learning Library)", "Android (Operating System)", "Recurrent Neural Network (RNN)", "Deep Learning", "HyperText Markup Language (HTML)", "Good Clinical Practices (GCP)", "Vuforia", "Nodes (Networking)", "Barcodes", "Cascading Style Sheets (CSS)", "Business To Business", "Emoji", "Firebase"], "summary": "am a graduate student at University at Bu alo, looking at a Machine Learning major along with supplementary courses in Algorithms and Data Science. My ongoing projects include learning the e ect of attention models used for machine translation on Genderbias. I am currently taking Deep Learning and Data Model and Query Language courses. My previous courses were Algorithm Analysis, Intro to Machine Learning, Computer Security and Information Retrieval, Advanced Machine Learning, Distributed Systems, Sequential and Parallel Algorithms.", "websites": ["parthshah1509.github.io"], "workExperience": [{"jobTitle": "Intern – Technical Team", "organization": "Cloud Counselage Pvt. Ltd,", "location": {"formatted": "Mumbai, Maharashtra, India", "streetNumber": null, "street": null, "apartmentNumber": null, "city": "Mumbai", "postalCode": null, "state": "Maharashtra", "country": "India", "rawInput": "Mumbai, India"}, "dates": {"startDate": "2018-03-01", "endDate": "2018-07-01", "monthsInPosition": 4, "isCurrent": false}, "jobDescription": "Handled technicalities for various SaaS Cloud products such as Edpedia – The Learning Management System, Job Cloud – The Online Job Board, Directory Cloud – The Online Business Directory Services & B2B Market Place. Created the skeleton for the android application for the company and its version control. Maintaining company website and increased server performance by 30% by migrating to GCP."}, {"jobTitle": "Intern – Android App Development", "organization": "FP Design - Part of Frischmann Prabhu India Pvt Ltd", "location": {"formatted": "Mumbai, Maharashtra, India", "streetNumber": null, "street": null, "apartmentNumber": null, "city": "Mumbai", "postalCode": null, "state": "Maharashtra", "country": "India", "rawInput": "Mumbai, India"}, "dates": {"startDate": "2017-09-01", "endDate": "2018-02-01", "monthsInPosition": 5, "isCurrent": false}, "jobDescription": "Designed an Augmented Reality (AR) based application which can be used to visualize life-size furniture in your room using your phone camera. Coalesced a feature which allows customers to customize furniture according to color/texture of their choice using barcodes from the catalogue. Used Unity and Vuforia for the AR part and Blender to create the 3D models as requested by the company."}]}, "meta": {"identifier": "TsrORFQN", "ready": true, "failed": false, "readyDt": "2021-02-22T22:37:42.116968Z", "user": {"documentCount": 9, "parsingCredits": 200, "email": "b.richards@ideaxdesign.com", "isTrial": true}, "fileName": "MLR26.pdf"}, "error": {"errorCode": null, "errorDetail": null}}