{"data": {"certifications": ["COURSES Real Time Operating System Computer Architecture Microprocessor Microcontroller Embedded System Design", "COURSES Operating Systems Advanced Computer Architecture Microprocessor System Design Hardware Design Verification"], "dateOfBirth": null, "education": [{"organization": "Texas A&M University", "accreditation": {"education": "Master of Science in Computer Engineering", "inputStr": "Masters in Computer Engineering", "matchStr": "Master in Computer Engineering", "educationLevel": "masters"}, "grade": {"raw": "GPA: 4.0/4.0", "metric": "GPA", "value": "4.0/4.0"}, "location": null, "dates": {"startDate": null, "completionDate": "2020-05-01", "isCurrent": false}}, {"organization": "National Institute of Technology", "accreditation": {"education": "B.Tech in Electronics and Communication Engineering", "inputStr": "B.Tech in Electronics and Communication Engineering", "matchStr": null, "educationLevel": null}, "grade": {"raw": "GPA: 8.05/10", "metric": "GPA", "value": "8.05/10"}, "location": {"formatted": "Warangal, Telangana, India", "streetNumber": null, "street": null, "apartmentNumber": null, "city": "Warangal", "postalCode": null, "state": "Telangana", "country": "India", "rawInput": "Warangal"}, "dates": {"startDate": null, "completionDate": "2016-05-01", "isCurrent": false}}], "emails": [], "location": null, "name": {"raw": "PEEYUSH KUMAR SINHA", "first": "Peeyush", "last": "Sinha", "middle": "Kumar", "title": ""}, "objective": "OBJECTIVE: Actively seeking full-time opportunities in ASIC Design and Implementation roles.", "phoneNumbers": ["(979)922-0985"], "publications": [], "referees": [], "sections": [{"sectionType": "PersonalDetails", "bbox": [223.442000001669, 38.8560342788696, 572.522312164307, 48.9129942655563], "pageIndex": 0, "text": "PEEYUSH KUMAR SINHA (979)922-0985"}, {"sectionType": "NotPopulated", "bbox": [21.6498003825545, 40.3573536872864, 129.48755645752, 49.3113942146301], "pageIndex": 0, "text": "peeks@tamu.edu LinkedIn"}, {"sectionType": "Summary", "bbox": [21.9486003816128, 63.7976932525635, 418.248809814453, 72.8413736820221], "pageIndex": 0, "text": "OBJECTIVE: Actively seeking full-time opportunities in ASIC Design and Implementation roles."}, {"sectionType": "Education", "bbox": [21.7593603879213, 83.2476944923401, 572.869129180908, 306.891361474991], "pageIndex": 0, "text": "EDUCATION: Texas A&M University, College Station \nMay 2020 \nMasters in Computer Engineering \nGPA: 4.0/4.0 \nCOURSES: Operating Systems, Advanced Computer Architecture, Microprocessor System Design, Hardware Design Verification \nDeep Learning in Computer Graphics, VLSI Machine Learning Systems, VLSI System Design, Digital Systems Testing \nNational Institute of Technology, Warangal \nMay 2016 \nB.Tech in Electronics and Communication Engineering \nGPA: 8.05/10 \nCOURSES: Real Time Operating System, Computer Architecture, Microprocessor & Microcontroller, Embedded System Design \nPROJECTS: \n• Implemented Cache Replacement Policies Hawkeye and Harmony and achieved a speedup of 8.4% over LRU • Zynq-7000 FPGA implementation of Linux based device driver for interrupt driven IR Remote Sensor System • Hardware Accelerators for Convolutional Neural Networks (CNNs) for image processing (similar to Eyeriss) and Long Short Term Memory Networks (LSTMs) for speech recognition dataset (similar to this) • Complete Verification of a HTAX Crossbar design in UVM Environment • Image Super-resolution using Generative Adversarial Networks (GANs), and Object Detection using CNNs \nSOFTWARE SKILLS: C/C++, SystemVerilog, Perl, Tcl, Python, Linux shell scripting TOOLS / SIMULATORS: Design Compiler, IC Compiler, Innovus, PrimeTime, Conformal, Seahawk, IC Validator, Pytorch, ChampSim, Design Vivado, VCS, SimVision, Cadence Incisive, Logic Vision, Spyglass"}, {"sectionType": "WorkExperience", "bbox": [20.9426403641701, 317.277723789215, 573.308532714844, 805.801361322403], "pageIndex": 0, "text": "WORK EXPERIENCE: NVIDIA Santa Clara Co-op Engineer, GPU Design Implementation \nMay 2019 - May2020 \n• End to End (Netlist to GDS) implementation of Physical Design activities consisting of Floor-planning and power planning, Logic placement, Clock-tree synthesis, Routing and optimization strategies to improve Power, Performance and Area of design • Logic Retiming to improve performance of hard-macro; debugged, enhanced and fixed issues and checks in the PnR flow. • SAIF generation and Vector based IR drop analysis, EM analysis, antenna checks, and exploring ways to tackle these violations. • Parasitic extraction, MCMM Static Timing Analysis; performing Timing ECOs for timing closure and design convergence • Physical Verification at Partition level for cleaning up DRC issues and LVS errors along with Functional ECOs implementation \nQUALCOMM India Pvt Ltd. Bangalore, India Associate Engineer, GPU Design Implementation \nJuly 2016 - August 2018 \n• GPU RTL Integration, cleaning up Clock Domain Crossing (CDC) violations and resolved Linting errors. • RTL MBIST insertion and simulation/verification, cleaning up CLP on RTL, generating UPF for power aware synthesis • Physically aware RTL Synthesis (DC-Graphical), logic retiming and optimized recipes resulting in improved Netlist QoR • DFT insertion and CLP cleanup on post-DFT netlist, followed by RTL → Netlist Equivalency check (Formal Verification) • Generation and validation of Functional and Test mode constraints; Multi-corner multi-mode (MCMM) Static Timing Analysis Timing correlation for design between DCG-PT with POCV PVT conditions, ECO implementation and quick Netlist delivery \nEngineering Intern, GPU Implementation Methodology \nMay 2015 – July 2015 \n• Explored clustering techniques for single bit to multibit flop merging, targeted at timing and congestion improvements. • Explored leakage power reduction opportunities by std cell swapping on non-timing critical paths. \nRECOGNITION: \n• Qualstar for achieving higher performance on a design without exceeding std cell area and power limits • Winner at IdeaQuest 2015, a design challenge organized for interns at Qualcomm India, Bangalore. • Selected to present an idea as a paper from amongst several paper submissions at QBUZZ-2016. • Amul Vidya Shree and Vidya Bhushan for academic excellence in Standard 10th and 12th respectively. • School Representative at JBNSTS, a Science workshop and meetup, organized by Government of India \nLEADERSHIP: • \nOrganized and Managed Paper presentations at QBUZZ-2016 (Qualcomm India technical conference) • Mentored undergrad students at HACKATHON-2015, in problem solving and debugging technical issues • Mentor at Innovation Garage, a 24x7 multidisciplinary workspace for innovation • Leader of School Quiz Club for various inter and intra school quizzing competitions. \nWORKSHOPS: \n• Fundamentals of Deep Learning for computer vision using Caffe and Digits (NVIDIA sponsored) • Fundamentals of Accelerated Computing with CUDA in C/C++ (NVIDIA sponsored) • Developing an ARM Cortex A9 based SoC using Zynq-7000 FPGA (Intel and NITW sponsored) \nWORK AUTHORIZATION: Authorized to work for 3 years under OPT (Optional Practical Training) without Sponsorship."}], "skills": ["Leadership", "Integration", "C (Programming Language)", "Problem Solving", "Presentations", "Innovation", "Debugging", "Computer Vision", "Physical Design", "Static Timing Analysis", "Formal Verification", "Caffe", "Recipes", "Reduction (Complexity)", "Deep Learning", "Graphics Processing Unit (GPU)", "Clock Domain Crossing", "Field-Programmable Gate Array (FPGA)", "Antenna", "Authorization (Computing)", "Retiming", "Planning", "Sexually Transmitted Disease (STD) Controls", "Netlist"], "summary": "", "websites": [], "workExperience": [{"jobTitle": "Co-op Engineer, GPU Design Implementation", "organization": "NVIDIA Santa Clara", "location": null, "dates": {"startDate": "2019-05-01", "endDate": "2020-05-01", "monthsInPosition": 12, "isCurrent": false}, "jobDescription": "End to End (Netlist to GDS) implementation of Physical Design activities consisting of Floor-planning and power planning, Logic placement, Clock-tree synthesis, Routing and optimization strategies to improve Power, Performance and Area of design Logic Retiming to improve performance of hard-macro; debugged, enhanced and fixed issues and checks in the PnR flow. SAIF generation and Vector based IR drop analysis, EM analysis, antenna checks, and exploring ways to tackle these violations. Parasitic extraction, MCMM Static Timing Analysis; performing Timing ECOs for timing closure and design convergence Physical Verification at Partition level for cleaning up DRC issues and LVS errors along with Functional ECOs implementation"}, {"jobTitle": "Associate Engineer, GPU Design Implementation", "organization": "QUALCOMM India Pvt Ltd.", "location": {"formatted": "Bengaluru, Karnataka, India", "streetNumber": null, "street": null, "apartmentNumber": null, "city": "Bengaluru", "postalCode": null, "state": "Karnataka", "country": "India", "rawInput": "Bangalore, India"}, "dates": {"startDate": "2016-07-01", "endDate": "2018-08-01", "monthsInPosition": 25, "isCurrent": false}, "jobDescription": "GPU RTL Integration, cleaning up Clock Domain Crossing (CDC) violations and resolved Linting errors. RTL MBIST insertion and simulation/verification, cleaning up CLP on RTL, generating UPF for power aware synthesis Physically aware RTL Synthesis (DC-Graphical), logic retiming and optimized recipes resulting in improved Netlist QoR DFT insertion and CLP cleanup on post-DFT netlist, followed by RTL → Netlist Equivalency check (Formal Verification) Generation and validation of Functional and Test mode constraints; Multi-corner multi-mode (MCMM) Static Timing Analysis Timing correlation for design between DCG-PT with POCV PVT conditions, ECO implementation and quick Netlist delivery"}, {"jobTitle": "Engineering Intern, GPU Implementation Methodology", "organization": null, "location": null, "dates": {"startDate": "2015-05-01", "endDate": "2015-07-01", "monthsInPosition": 2, "isCurrent": false}, "jobDescription": "Explored clustering techniques for single bit to multibit flop merging, targeted at timing and congestion improvements. Explored leakage power reduction opportunities by std cell swapping on non-timing critical paths. RECOGNITION: Qualstar for achieving higher performance on a design without exceeding std cell area and power limits Winner at IdeaQuest 2015, a design challenge organized for interns at Qualcomm India, Bangalore. Selected to present an idea as a paper from amongst several paper submissions at QBUZZ-2016. Amul Vidya Shree and Vidya Bhushan for academic excellence in Standard 10th and 12th respectively. School Representative at JBNSTS, a Science workshop and meetup, organized by Government of India LEADERSHIP: Organized and Managed Paper presentations at QBUZZ-2016 (Qualcomm India technical conference) Mentored undergrad students at HACKATHON-2015, in problem solving and debugging technical issues Mentor at Innovation Garage, a 24x7 multidisciplinary workspace for innovation Leader of School Quiz Club for various inter and intra school quizzing competitions. WORKSHOPS: Fundamentals of Deep Learning for computer vision using Caffe and Digits (NVIDIA sponsored) Fundamentals of Accelerated Computing with CUDA in C/C++ (NVIDIA sponsored) Developing an ARM Cortex A9 based SoC using Zynq-7000 FPGA (Intel and NITW sponsored) WORK AUTHORIZATION: Authorized to work for 3 years under OPT (Optional Practical Training) without Sponsorship."}], "headShot": null}, "meta": {"identifier": "YoJCyoWO", "ready": true, "failed": false, "readyDt": "2021-03-18T19:14:20.289832Z", "user": {"documentCount": 17, "parsingCredits": 200, "email": "krshantam973@gmail.com", "isTrial": true}, "fileName": "Peeyush Resume.pdf"}, "error": {"errorCode": null, "errorDetail": null}}