{"data": {"certifications": ["Description Microsoft rewards is loyalty program that rewards Users for", "Description Microsoft rewards is loyalty program that rewards Users for"], "dateOfBirth": null, "education": [{"organization": "The University of Manchester", "accreditation": {"education": "", "inputStr": "", "matchStr": null, "educationLevel": null}, "grade": null, "location": {"formatted": "United Kingdom", "streetNumber": null, "street": null, "apartmentNumber": null, "city": null, "postalCode": null, "state": null, "country": "United Kingdom", "rawInput": "UK"}, "dates": {"startDate": null, "completionDate": "2007-01-01", "isCurrent": false}}], "emails": [], "location": {"formatted": "Manchester, UK", "streetNumber": null, "street": null, "apartmentNumber": null, "city": "Manchester", "postalCode": null, "state": "England", "country": "United Kingdom", "rawInput": "Manchester, UK"}, "name": {"raw": "Michael Smith", "first": "Michael", "last": "Smith", "middle": "", "title": ""}, "objective": "", "phoneNumbers": [], "publications": [], "referees": [], "sections": [{"sectionType": "PersonalDetails", "bbox": [90.0959944427013, 74.2229833602905, 521.77173614502, 697.059007048607], "pageIndex": 0, "text": "Michael Smith \nBI / Big Data/ Azure \nManchester, UK- Email me on Indeed: indeed.com/r/falicent/140749dace5dc26f \n10+ years of Experience in Designing, Development, Administration, Analysis, Management inthe Business Intelligence Data warehousing, Client Server Technologies, Web-based Applications, cloud solutions and Databases. Data warehouse: Data analysis, star/ snow flake schema data modeling and design specific todata warehousing and business intelligence environment. Database: Experience in database designing, scalability, back-up and recovery, writing andoptimizing SQL code and Stored Procedures, creating functions, views, triggers and indexes. Cloud platform: Worked on Microsoft Azure cloud services like Document DB, SQL Azure, StreamAnalytics, Event hub, Power BI, Web Job, Web App, Power BI, Azure data lake analytics(U-SQL) . Big Data: Worked Azure data lake store/analytics for big data processing and Azure data factoryto schedule U-SQL jobs. Designed and developed end to end big data solution for data insights. \nWilling to relocate: Anywhere \nWORK EXPERIENCESoftware Engineer \nMicrosoft - Manchester, UK. December 2015 to Present 1. Microsoft Rewards Live dashboards: Description: - Microsoft rewards is loyalty program that rewards Users for browsing and shopping online. Microsoft Rewards members can earn points when searching with Bing, browsing with Microsoft Edge and making purchases at the Xbox Store, the Windows Store and the Microsoft Store. Plus, user can pick up bonus points for taking daily quizzes and tours on the Microsoft rewards website. Rewards live dashboards gives a live picture of usage world-wide and by markets like US, Canada, Australia, new user registration count, top/bottom performing rewards offers, orders stats and weekly trends of user activities, orders and new user registrations. the PBI tiles gets refreshed in different frequencies starting from 5 seconds to 30 minutes. Technology/Tools used Event hub, stream analytics and Power BI. Responsibilities Created stream analytics jobs to process event hub data Created Power BI live dashboard to show live usage traffic, weekly trends, cards, charts to showtop/bottom 10 offers and usage metrics. 2. Microsoft Rewards Data Insights: Description: - Microsoft rewards is loyalty program that rewards Users for browsing and shopping online. Microsoft Rewards members can earn points when searching with Bing, browsing with Microsoft Edge and making purchases at the Xbox Store, the Windows Store and the Microsoft Store. Plus, user can pick up bonus points for taking daily quizzes and tours on the Microsoft rewards website. Rewards data insights is data analytics and reporting platform, processes 20 million users daily activities and redemption across different markets like US, Canada, Australia. Technology/Tools used Cosmos (Microsoft big-data platform), c#, X-flow job monitoring, Power BI. Responsibilities"}, {"sectionType": "PersonalDetails", "bbox": [90.0959944427013, 74.2229833602905, 522.037887573242, 495.793015837669], "pageIndex": 1, "text": "Created big data scripts in cosmos C# data extractors, processors and reducers for data transformation Power BI dashboards \n3. End to end tracking Tool: Description: - This is real-time Tracking tool to track different business transactions like order, order response, functional acknowledgement, invoice flowing inside ICOE. It gives flexibility to customers to track their transactions and appropriate error information in-case of any failure. Based on resource based access control the tool gives flexibility to end user to perform different actions like view transactions, search based on different filter criteria and view and download actual message payload. End to end tracking tool stitches all the business transaction like order to cash flow and connects different hops inside ICOE like gateway, routing server, Processing server. It also connects different systems like ICOE, partner end point and SAP. Technology/Tools used Azure Document db, Azure web job and Web APP, RBAC, Angular JS. Responsibilities Document dB stored procedures. Web job to process event hub data and populate Document db• Web App API. Stream analytics job to transform data Power BI reports 4. Biztrack Tracking Tool: Description: - This is real-time Tracking tool to track different business transactions like order, order response, functional acknowledgement, invoice flowing inside ICOE. It gives flexibility to customers to track their transactions and appropriate error information in-case of any failure. Based on resource based access control the tool gives flexibility to end user to perform different actions like view transactions, search based on different filter criteria and view and download actual message payload. Technology/Tools used SQL server 2014, SSIS, .net API, Angular JS. Responsibilities ETL solution to transform business transactions data stored in Biztalk tables. SQL azure tables, stored procedures, User defined functions. Performance tuning."}, {"sectionType": "Projects", "bbox": [90.1859944462776, 501.553007602692, 201.395011901855, 507.205007314682], "pageIndex": 1, "text": "Web API enhancements."}, {"sectionType": "Education", "bbox": [90.4109944403172, 527.613995552063, 268.024981498718, 558.795998156071], "pageIndex": 1, "text": "EDUCATION The University of Manchester - UK 2007"}, {"sectionType": "Skills/Interests/Languages", "bbox": [90.0959944427013, 579.214001655579, 521.951759338379, 697.419007658958], "pageIndex": 1, "text": "SKILLS \nproblem solving (Less than 1 year), project lifecycle (Less than 1 year), project manager (Less than 1 year), technical assistance. (Less than 1 year) ADDITIONAL INFORMATION Professional Skills Excellent analytical, problem solving, communication, knowledge transfer and interpersonalskills with ability to interact with individuals at all the levels Quick learner and maintains cordial relationship with project manager and team members andgood performer both in team and independent job environments Positive attitude towards superiors & peers"}, {"sectionType": "WorkExperience", "bbox": [90.6539944410324, 74.2229833602905, 521.213691711426, 91.3549706935883], "pageIndex": 2, "text": "Supervised junior developers throughout project lifecycle and provided technical assistance."}], "skills": ["Management", "Writing", "SQL (Programming Language)", "Data Analysis", "C (Programming Language)", "Business Intelligence", "Problem Solving", "Analytics", "R (Programming Language)", "Data Modeling", "Data Warehousing", "Big Data", "SAP CRM", "Data Processing", "Performance Tuning", "Data Transformation", "Scalability", "Microsoft Azure", "Registration", "Technical Assistance", "SQL Azure", "Dashboard", "Microsoft Windows", "User Defined Functions", "Microsoft Edge", "LESS", "Warehousing", "Windows Store", "Power BI", "Angular (Web Framework)", "Role-Based Access Control (RBAC)", "Extract Transform Load (ETL)", "Application Programming Interface (API)", "SQL Server Integration Services (SSIS)", "U-SQL", "User Registration", "Transformation (Genetics)", "Azure Cloud Services"], "languages": [], "summary": "- Email me on Indeed: indeed.com/r/falicent/140749dace5dc26f10+ years of Experience in Designing, Development, Administration, Analysis, Management inthe Business Intelligence Data warehousing, Client Server Technologies, Web-based Applications, cloud solutions and Databases. Data warehouse: Data analysis, star/ snow flake schema data modeling and design specific todata warehousing and business intelligence environment. Database: Experience in database designing, scalability, back-up and recovery, writing andoptimizing SQL code and Stored Procedures, creating functions, views, triggers and indexes. Cloud platform: Worked on Microsoft Azure cloud services like Document DB, SQL Azure, StreamAnalytics, Event hub, Power BI, Web Job, Web App, Power BI, Azure data lake analytics(U-SQL) . Big Data: Worked Azure data lake store/analytics for big data processing and Azure data factoryto schedule U-SQL jobs. Designed and developed end to end big data solution for data insights.Microsoft - . December 2015 to Present 1. Microsoft Rewards Live dashboards: Description: - Microsoft rewards is loyalty program that rewards Users for browsing and shopping online. Microsoft Rewards members can earn points when searching with Bing, browsing with Microsoft Edge and making purchases at the Xbox Store, the Windows Store and the Microsoft Store. Plus, user can pick up bonus points for taking daily quizzes and tours on the Microsoft rewards website. Rewards live dashboards gives a live picture of usage world-wide and by markets like US, Canada, Australia, new user registration count, top/bottom performing rewards offers, orders stats and weekly trends of user activities, orders and new user registrations. the PBI tiles gets refreshed in different frequencies starting from 5 seconds to 30 minutes. Technology/Tools used Event hub, stream analytics and Power BI. Responsibilities Created stream analytics jobs to process event hub data Created Power BI live dashboard to show live usage traffic, weekly trends, cards, charts to showtop/bottom 10 offers and usage metrics. 2. Microsoft Rewards Data Insights: Description: - Microsoft rewards is loyalty program that rewards Users for browsing and shopping online. Microsoft Rewards members can earn points when searching with Bing, browsing with Microsoft Edge and making purchases at the Xbox Store, the Windows Store and the Microsoft Store. Plus, user can pick up bonus points for taking daily quizzes and tours on the Microsoft rewards website. Rewards data insights is data analytics and reporting platform, processes 20 million users daily activities and redemption across different markets like US, Canada, Australia. Technology/Tools used Cosmos (Microsoft big-data platform), c#, X-flow job monitoring, Power BI. ResponsibilitiesCreated big data scripts in cosmos C# data extractors, processors and reducers for data transformation Power BI dashboards3. End to end tracking Tool: Description: - This is real-time Tracking tool to track different business transactions like order, order response, functional acknowledgement, invoice flowing inside ICOE. It gives flexibility to customers to track their transactions and appropriate error information in-case of any failure. Based on resource based access control the tool gives flexibility to end user to perform different actions like view transactions, search based on different filter criteria and view and download actual message payload. End to end tracking tool stitches all the business transaction like order to cash flow and connects different hops inside ICOE like gateway, routing server, Processing server. It also connects different systems like ICOE, partner end point and SAP. Technology/Tools used Azure Document db, Azure web job and Web APP, RBAC, Angular JS. Responsibilities Document dB stored procedures. Web job to process event hub data and populate Document db Web App API. Stream analytics job to transform data Power BI reports 4. Biztrack Tracking Tool: Description: - This is real-time Tracking tool to track different business transactions like order, order response, functional acknowledgement, invoice flowing inside ICOE. It gives flexibility to customers to track their transactions and appropriate error information in-case of any failure. Based on resource based access control the tool gives flexibility to end user to perform different actions like view transactions, search based on different filter criteria and view and download actual message payload. Technology/Tools used SQL server 2014, SSIS, .net API, Angular JS. Responsibilities ETL solution to transform business transactions data stored in Biztalk tables. SQL azure tables, stored procedures, User defined functions. Performance tuning.", "websites": [], "workExperience": [], "headShot": null}, "meta": {"identifier": "eNWFfEiG", "ready": true, "failed": false, "readyDt": "2021-04-01T21:51:59.195964Z", "user": {"documentCount": 47, "redactedDocumentCount": 0, "parsingCredits": 200, "redactionCredits": 200}, "fileName": "Smith Resume.pdf"}, "error": {"errorCode": null, "errorDetail": null}}